# Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк,
# длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры,
# либо задать на старте выполнения алгоритма.

array_in = ['1234', '1567', '-2', 'computer science']  # задаем массив

array_out = []
count = 0

# перебираем начальный массив и добавляем элементы с длиной меньше 3 в новый массив
for el in array_in:
    if len(el) <= 3:
        array_out.insert(count, el)
        count += 1

# вывод
print(f'{array_in} -> {array_out}')
